## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 6 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         RESOURCE                         |
|----------|----------------------------------------------------------|
| update   | `module.idp_ecs.aws_ecs_service.this`                    |
|          | `module.login_ecs.aws_ecs_service.this`                  |
|          | `module.login_ecs.aws_iam_policy.this_task[0]`           |
|          | `module.login_ecs.aws_iam_policy.this_task_exec`         |
|          | `module.login_ecs.aws_iam_role.this_task`                |
|          | `module.login_ecs.aws_iam_role.this_task_exec`           |
| recreate | `module.login_ecs.aws_ecs_task_definition.this`          |
| delete   | `aws_security_group_rule.idp_ecs_ingress_idp_login_ecs`  |
|          | `aws_security_group_rule.idp_login_ecs_egress_idp_ecs`   |
|          | `aws_service_discovery_private_dns_namespace.idp`        |
|          | `module.idp_ecs.aws_service_discovery_service.this[0]`   |
|          | `module.login_ecs.aws_service_discovery_service.this[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group_rule.idp_ecs_ingress_idp_login_ecs will be destroyed
  # (because aws_security_group_rule.idp_ecs_ingress_idp_login_ecs is not in configuration)
  - resource "aws_security_group_rule" "idp_ecs_ingress_idp_login_ecs" {
      - description              = "Ingress from idp login ECS task to idp ECS task" -> null
      - from_port                = 8080 -> null
      - id                       = "sgrule-2911044723" -> null
      - protocol                 = "tcp" -> null
      - region                   = "ca-central-1" -> null
      - security_group_id        = "sg-008275cfe29ee08c6" -> null
      - security_group_rule_id   = "sgr-02b2b48a66a0f8be5" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0c1042c20d01adb28" -> null
      - to_port                  = 8080 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.idp_login_ecs_egress_idp_ecs will be destroyed
  # (because aws_security_group_rule.idp_login_ecs_egress_idp_ecs is not in configuration)
  - resource "aws_security_group_rule" "idp_login_ecs_egress_idp_ecs" {
      - description              = "Egress from idp login ECS task to idp ECS task" -> null
      - from_port                = 8080 -> null
      - id                       = "sgrule-1303912167" -> null
      - protocol                 = "tcp" -> null
      - region                   = "ca-central-1" -> null
      - security_group_id        = "sg-0c1042c20d01adb28" -> null
      - security_group_rule_id   = "sgr-0248d5e4b640e9bda" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-008275cfe29ee08c6" -> null
      - to_port                  = 8080 -> null
      - type                     = "egress" -> null
    }

  # aws_service_discovery_private_dns_namespace.idp will be destroyed
  # (because aws_service_discovery_private_dns_namespace.idp is not in configuration)
  - resource "aws_service_discovery_private_dns_namespace" "idp" {
      - arn         = "arn:aws:servicediscovery:ca-central-1:915144821201:namespace/ns-z4xbw4djmvikx7ac" -> null
      - description = "DNS namespace used to provide service discovery for the IdP ECS services" -> null
      - hosted_zone = "Z077170335P0CEHYAIKT4" -> null
      - id          = "ns-z4xbw4djmvikx7ac" -> null
      - name        = "idp.ecs.local" -> null
      - region      = "ca-central-1" -> null
      - tags        = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all    = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - vpc         = "vpc-0ee94b5ea7d7e0f20" -> null
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:915144821201:service/idp/idp"
        name                               = "idp"
        tags                               = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

      - service_registries {
          - container_name = "idp" -> null
          - container_port = 0 -> null
          - port           = 0 -> null
          - registry_arn   = "arn:aws:servicediscovery:ca-central-1:915144821201:service/srv-cviov5qamusfyote" -> null
        }

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_service_discovery_service.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_service_discovery_service" "this" {
      - arn           = "arn:aws:servicediscovery:ca-central-1:915144821201:service/srv-cviov5qamusfyote" -> null
      - force_destroy = false -> null
      - id            = "srv-cviov5qamusfyote" -> null
      - name          = "idp" -> null
      - namespace_id  = "ns-z4xbw4djmvikx7ac" -> null
      - region        = "ca-central-1" -> null
      - tags          = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all      = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - type          = "DNS_HTTP" -> null
        # (1 unchanged attribute hidden)

      - dns_config {
          - namespace_id   = "ns-z4xbw4djmvikx7ac" -> null
          - routing_policy = "MULTIVALUE" -> null

          - dns_records {
              - ttl  = 10 -> null
              - type = "A" -> null
            }
        }

      - health_check_custom_config {
          - failure_threshold = 1 -> null
        }
    }

  # module.login_ecs.data.aws_ecs_cluster.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_cluster" "this" {
      + arn                                  = (known after apply)
      + cluster_name                         = "idp"
      + id                                   = (known after apply)
      + pending_tasks_count                  = (known after apply)
      + region                               = (known after apply)
      + registered_container_instances_count = (known after apply)
      + running_tasks_count                  = (known after apply)
      + service_connect_defaults             = (known after apply)
      + setting                              = (known after apply)
      + status                               = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_combined[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "elasticfilesystem:DescribeMountTargets",
                              + "elasticfilesystem:ClientWrite",
                              + "elasticfilesystem:ClientMount",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:elasticfilesystem:ca-central-1:915144821201:file-system/fs-07396447ef54973d2"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssmmessages:OpenDataChannel",
                              + "ssmmessages:OpenControlChannel",
                              + "ssmmessages:CreateDataChannel",
                              + "ssmmessages:CreateControlChannel",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "CreateSSMTunnel"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_exec_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_secret_key",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_loginclient_machine_username",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_username",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_password",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_host",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_admin_username",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_admin_password",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_admin_username",
                              + "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_admin_password",
                            ]
                          + Sid      = "GetSSMParameters"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_exec_ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.login_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:915144821201:log-group:/aws/ecs/idp/idp-login:*",
            ]
        }
    }

  # module.login_ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.login_ecs.data.aws_ssm_parameter.container_image_deployed[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "container_image_deployed" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/ecs/idp/idp-login/container-image"
      + region         = (known after apply)
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.login_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:915144821201:service/idp/idp-login"
        name                               = "idp-login"
        tags                               = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:915144821201:task-definition/idp-login:3" -> (known after apply)
        # (18 unchanged attributes hidden)

      - service_registries {
          - container_name = "idp-login" -> null
          - container_port = 0 -> null
          - port           = 0 -> null
          - registry_arn   = "arn:aws:servicediscovery:ca-central-1:915144821201:service/srv-g6v24t26lkc5aqf5" -> null
        }

        # (5 unchanged blocks hidden)
    }

  # module.login_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:915144821201:task-definition/idp-login:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:915144821201:task-definition/idp-login" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment            = [
                      - {
                          - name  = "CUSTOM_REQUEST_HEADERS"
                          - value = "Host:idp.cdssandbox.xyz"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_BASE_PATH"
                          - value = "/ui/v2/login"
                        },
                      - {
                          - name  = "ZITADEL_API_URL"
                          - value = "https://idp.idp.ecs.local:8080"
                        },
                      - {
                          - name  = "ZITADEL_SERVICE_USER_TOKEN_FILE"
                          - value = "/idp/login-client.pat"
                        },
                    ]
                  - essential              = true
                  - image                  = "915144821201.dkr.ecr.ca-central-1.amazonaws.com/idp-login:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - add  = []
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/idp/idp-login"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = [
                      - {
                          - containerPath = "/idp"
                          - readOnly      = false
                          - sourceVolume  = "idp-data"
                        },
                    ]
                  - name                   = "idp-login"
                  - portMappings           = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "idp-login" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
        tags                     = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "idp-data" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-07396447ef54973d2" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-07b3a518bf319b8b3" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "idp-data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-07396447ef54973d2"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-07b3a518bf319b8b3"
                  + iam             = "ENABLED"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.login_ecs.aws_iam_policy.this_task[0] will be updated in-place
  ~ resource "aws_iam_policy" "this_task" {
        id               = "arn:aws:iam::915144821201:policy/idp-login_ecs_task_policy"
        name             = "idp-login_ecs_task_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticfilesystem:DescribeMountTargets",
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticfilesystem:ca-central-1:915144821201:file-system/fs-07396447ef54973d2"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CreateSSMTunnel"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.login_ecs.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id               = "arn:aws:iam::915144821201:policy/idp-login_ecs_task_exec_policy"
        name             = "idp-login_ecs_task_exec_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:915144821201:log-group:/aws/ecs/idp/idp-login:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_secret_key",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_loginclient_machine_username",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_username",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_password",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_host",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_admin_username",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database_admin_password",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_database",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_admin_username",
                          - "arn:aws:ssm:ca-central-1:915144821201:parameter/idp_admin_password",
                        ]
                      - Sid      = "GetSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.login_ecs.aws_iam_role.this_task will be updated in-place
  ~ resource "aws_iam_role" "this_task" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "idp-login_ecs_task_role"
        name                  = "idp-login_ecs_task_role"
        tags                  = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # module.login_ecs.aws_iam_role.this_task_exec will be updated in-place
  ~ resource "aws_iam_role" "this_task_exec" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "idp-login_ecs_task_exec_role"
        name                  = "idp-login_ecs_task_exec_role"
        tags                  = {
            "CostCentre" = "unified-accounts-staging"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # module.login_ecs.aws_service_discovery_service.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_service_discovery_service" "this" {
      - arn           = "arn:aws:servicediscovery:ca-central-1:915144821201:service/srv-g6v24t26lkc5aqf5" -> null
      - force_destroy = false -> null
      - id            = "srv-g6v24t26lkc5aqf5" -> null
      - name          = "idp-login" -> null
      - namespace_id  = "ns-z4xbw4djmvikx7ac" -> null
      - region        = "ca-central-1" -> null
      - tags          = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all      = {
          - "CostCentre" = "unified-accounts-staging"
          - "Terraform"  = "true"
        } -> null
      - type          = "DNS_HTTP" -> null
        # (1 unchanged attribute hidden)

      - dns_config {
          - namespace_id   = "ns-z4xbw4djmvikx7ac" -> null
          - routing_policy = "MULTIVALUE" -> null

          - dns_records {
              - ttl  = 10 -> null
              - type = "A" -> null
            }
        }

      - health_check_custom_config {
          - failure_threshold = 1 -> null
        }
    }

Plan: 1 to add, 6 to change, 6 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 4 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
